#language: ru


 Функционал: Проверка работы Cell Sampler
  Сценарий: Проверка изменения текста
  Пусть загружена страница Cell Sampler
  Когда изменен текст в EditText
  И изменен текст в TextInput
  И нажата кнопка Commit Changes
  То текст в Text совпадает
То текст в EditText совпадает
То текст в TextInput совпадает
То текст в ClickableText совпадает
То текст в Button совпадает
Когда нажат ClickableText
То открыто всплывающее окно
И текст во всплывающем окне совпадает
Когда нажат Action
То открыто всплывающее окно
И текст во всплывающем окне совпадает
Когда нажата кнопка Button
То открыто всплывающее окно
И текст во всплывающем окне совпадает
